blog1/app/controllers/articles_controller.rb

  def index
    @articles = Article.order(created_at: :desc)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

  def create
    @article = Article.new(article_params)
    @article.user_id=current_user.id
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "あいうえお"], ["body", "かきｋｆじゃｌｄｆじゃｋｌｄｆｊぁｊｆｄ；ｌｋじゃｋｌｄｊふぁ"], ["created_at", "2021-05-25 12:01:36.332585"], ["updated_at", "2021-05-25 12:01:36.332585"], ["user_id", 2]]

  def destroy
    if @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]

  def set_ranking
    ids = REDIS.zrevrangebyscore "ranking", "+inf", -1, limit: [0, 3]
      @ranking_articles = ids.map{ |id| Article.find(id) }
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]